bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA329P.xml
            <module name="JTAG">
                <instance name="JTAG" caption="JTAG Interface">
                    <register-group name="JTAG" name-in-module="JTAG" offset="0x00" address-space="data"
                                    caption="JTAG Interface"/>
                    <signals>
                        <signal group="TCK" function="default" pad="PF4"/>
                        <signal group="TMS" function="default" pad="PF5"/>
                        <signal group="TDO" function="default" pad="PF6"/>
                        <signal group="TDI" function="default" pad="PF7"/>
                    </signals>
                </instance>
            </module>
            <module name="LCD">
                <instance name="LCD" caption="Liquid Crystal Display">
                    <register-group name="LCD" name-in-module="LCD" offset="0x00" address-space="data"
                                    caption="Liquid Crystal Display"/>
                    <signals>
                        <signal group="SEG" index="0" function="default" pad="PA4"/>
                        <signal group="SEG" index="1" function="default" pad="PA5"/>
                        <signal group="SEG" index="2" function="default" pad="PA6"/>
                        <signal group="SEG" index="3" function="default" pad="PA7"/>
                        <signal group="SEG" index="4" function="default" pad="PG2"/>
                        <signal group="SEG" index="5" function="default" pad="PC7"/>
                        <signal group="SEG" index="6" function="default" pad="PC6"/>
                        <signal group="SEG" index="7" function="default" pad="PC5"/>
                        <signal group="SEG" index="8" function="default" pad="PC4"/>
                        <signal group="SEG" index="9" function="default" pad="PC3"/>
                        <signal group="SEG" index="10" function="default" pad="PC2"/>
                        <signal group="SEG" index="11" function="default" pad="PC1"/>
                        <signal group="SEG" index="12" function="default" pad="PC0"/>
                        <signal group="SEG" index="13" function="default" pad="PG1"/>
                        <signal group="SEG" index="14" function="default" pad="PG2"/>
                        <signal group="SEG" index="15" function="default" pad="PD7"/>
                        <signal group="SEG" index="16" function="default" pad="PD6"/>
                        <signal group="SEG" index="17" function="default" pad="PD5"/>
                        <signal group="SEG" index="18" function="default" pad="PD4"/>
                        <signal group="SEG" index="19" function="default" pad="PD3"/>
                        <signal group="SEG" index="20" function="default" pad="PD2"/>
                        <signal group="SEG" index="21" function="default" pad="PD1"/>
                        <signal group="SEG" index="22" function="default" pad="PD0"/>
                        <signal group="SEG" index="23" function="default" pad="PG4"/>
                        <signal group="SEG" index="24" function="default" pad="PG3"/>
                        <signal group="COM" index="0" function="default" pad="PA0"/>
                        <signal group="COM" index="1" function="default" pad="PA1"/>
                        <signal group="COM" index="2" function="default" pad="PA2"/>
                        <signal group="COM" index="3" function="default" pad="PA3"/>
                    </signals>
                </instance>
            </module>
            <module name="EXINT">
                <instance name="EXINT" caption="External Interrupts">
                    <register-group name="EXINT" name-in-module="EXINT" offset="0x00" address-space="data"
                                    caption="External Interrupts"/>
                    <signals>
                        <signal group="PCINT" index="0" function="default" pad="PE0"/>
                        <signal group="PCINT" index="1" function="default" pad="PE1"/>
                        <signal group="PCINT" index="2" function="default" pad="PE2"/>
                        <signal group="PCINT" index="3" function="default" pad="PE3"/>
                        <signal group="PCINT" index="4" function="default" pad="PE4"/>
                        <signal group="PCINT" index="5" function="default" pad="PE5"/>
                        <signal group="PCINT" index="6" function="default" pad="PE6"/>
                        <signal group="PCINT" index="7" function="default" pad="PE7"/>
                        <signal group="PCINT" index="8" function="default" pad="PB0"/>
                        <signal group="PCINT" index="9" function="default" pad="PB1"/>
                        <signal group="PCINT" index="10" function="default" pad="PB2"/>
                        <signal group="PCINT" index="11" function="default" pad="PB3"/>
                        <signal group="PCINT" index="12" function="default" pad="PB4"/>
                        <signal group="PCINT" index="13" function="default" pad="PB5"/>
                        <signal group="PCINT" index="14" function="default" pad="PB6"/>
                        <signal group="PCINT" index="15" function="default" pad="PB7"/>
                        <signal group="INT" index="0" function="default" pad="PD1"/>
                    </signals>
                </instance>
            </module>
            <module name="CPU">
                <instance name="CPU" caption="CPU Registers">
                    <register-group name="CPU" name-in-module="CPU" offset="0x00" address-space="data"
                                    caption="CPU Registers"/>
                    <signals>
                        <signal group="CLK" index="0" function="default" pad="PE7"/>
                    </signals>
                    <parameters>
                        <param name="CORE_VERSION" value="V2E"/>
                    </parameters>
                </instance>
            </module>
