bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA329P.xml
        <module caption="Analog Comparator" name="AC">
            <register-group caption="Analog Comparator" name="AC">
                <register caption="ADC Control and Status Register B" name="ADCSRB" offset="0x7B" size="1">
                    <bitfield caption="Analog Comparator Multiplexer Enable" mask="0x40" name="ACME"/>
                </register>
                <register caption="Analog Comparator Control And Status Register" name="ACSR" offset="0x50" size="1"
                          ocd-rw="R">
                    <bitfield caption="Analog Comparator Disable" mask="0x80" name="ACD"/>
                    <bitfield caption="Analog Comparator Bandgap Select" mask="0x40" name="ACBG"/>
                    <bitfield caption="Analog Compare Output" mask="0x20" name="ACO"/>
                    <bitfield caption="Analog Comparator Interrupt Flag" mask="0x10" name="ACI"/>
                    <bitfield caption="Analog Comparator Interrupt Enable" mask="0x08" name="ACIE"/>
                    <bitfield caption="Analog Comparator Input Capture Enable" mask="0x04" name="ACIC"/>
                    <bitfield caption="Analog Comparator Interrupt Mode Select bits" mask="0x03" name="ACIS"
                              values="ANALOG_COMP_INTERRUPT"/>
                </register>
                <register caption="Digital Input Disable Register 1" name="DIDR1" offset="0x7F" size="1">
                    <bitfield caption="AIN1 Digital Input Disable" mask="0x02" name="AIN1D"/>
                    <bitfield caption="AIN0 Digital Input Disable" mask="0x01" name="AIN0D"/>
                </register>
            </register-group>
            <value-group caption="" name="ANALOG_COMP_INTERRUPT">
                <value caption="Interrupt on Toggle" name="VAL_0x00" value="0x00"/>
                <value caption="Reserved" name="VAL_0x01" value="0x01"/>
                <value caption="Interrupt on Falling Edge" name="VAL_0x02" value="0x02"/>
                <value caption="Interrupt on Rising Edge" name="VAL_0x03" value="0x03"/>
            </value-group>
        </module>
        <module caption="JTAG Interface" name="JTAG">
            <register-group caption="JTAG Interface" name="JTAG">
                <register caption="On-Chip Debug Related Register in I/O Memory" name="OCDR" offset="0x51" size="1"
                          mask="0xFF" ocd-rw=""/>
                <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
                    <bitfield caption="JTAG Interface Disable" mask="0x80" name="JTD"/>
                </register>
                <register caption="MCU Status Register" name="MCUSR" offset="0x54" size="1" ocd-rw="R">
                    <bitfield caption="JTAG Reset Flag" mask="0x10" name="JTRF"/>
                </register>
            </register-group>
        </module>
        <module caption="External Interrupts" name="EXINT">
            <register-group caption="External Interrupts" name="EXINT">
                <register caption="External Interrupt Control Register A" name="EICRA" offset="0x69" size="1">
                    <bitfield caption="External Interrupt Sense Control 0 Bit 1" mask="0x02" name="ISC01"/>
                    <bitfield caption="External Interrupt Sense Control 0 Bit 0" mask="0x01" name="ISC00"
                              values="INTERRUPT_SENSE_CONTROL"/>
                </register>
                <register caption="External Interrupt Mask Register" name="EIMSK" offset="0x3D" size="1">
                    <bitfield caption="Pin Change Interrupt Enables" mask="0xF0" name="PCIE"/>
                    <bitfield caption="External Interrupt Request 0 Enable" mask="0x01" name="INT0"/>
                </register>
                <register caption="External Interrupt Flag Register" name="EIFR" offset="0x3C" size="1" ocd-rw="R">
                    <bitfield caption="Pin Change Interrupt Flags" mask="0xF0" name="PCIF"/>
                    <bitfield caption="External Interrupt Flag 0" mask="0x01" name="INTF0"/>
                </register>
                <register caption="Pin Change Mask Register 1" name="PCMSK1" offset="0x6C" size="1" mask="0xFF">
                    <bitfield caption="Pin Change Mask Register pin 8" mask="0x01" name="PCINT8"/>
                    <bitfield caption="Pin Change Mask Register pin 9" mask="0x02" name="PCINT9"/>
                    <bitfield caption="Pin Change Mask Register pin 10" mask="0x04" name="PCINT10"/>
                    <bitfield caption="Pin Change Mask Register pin 11" mask="0x08" name="PCINT11"/>
                    <bitfield caption="Pin Change Mask Register pin 12" mask="0x10" name="PCINT12"/>
                    <bitfield caption="Pin Change Mask Register pin 13" mask="0x20" name="PCINT13"/>
                    <bitfield caption="Pin Change Mask Register pin 14" mask="0x40" name="PCINT14"/>
                    <bitfield caption="Pin Change Mask Register pin 15" mask="0x80" name="PCINT15"/>
                </register>
                <register caption="Pin Change Mask Register 0" name="PCMSK0" offset="0x6B" size="1" mask="0xFF">
                    <bitfield caption="Pin Change Mask Register pin 0" mask="0x01" name="PCINT0"/>
                    <bitfield caption="Pin Change Mask Register pin 1" mask="0x02" name="PCINT1"/>
                    <bitfield caption="Pin Change Mask Register pin 2" mask="0x04" name="PCINT2"/>
                    <bitfield caption="Pin Change Mask Register pin 3" mask="0x08" name="PCINT3"/>
                    <bitfield caption="Pin Change Mask Register pin 4" mask="0x10" name="PCINT4"/>
                    <bitfield caption="Pin Change Mask Register pin 5" mask="0x20" name="PCINT5"/>
                    <bitfield caption="Pin Change Mask Register pin 6" mask="0x40" name="PCINT6"/>
                    <bitfield caption="Pin Change Mask Register pin 7" mask="0x80" name="PCINT7"/>
                </register>
            </register-group>
            <value-group caption="Interrupt Sense Control" name="INTERRUPT_SENSE_CONTROL">
                <value caption="Low Level of INTX" name="VAL_0x00" value="0x00"/>
                <value caption="Any Logical Change of INTX" name="VAL_0x01" value="0x01"/>
                <value caption="Falling Edge of INTX" name="VAL_0x02" value="0x02"/>
                <value caption="Rising Edge of INTX" name="VAL_0x03" value="0x03"/>
            </value-group>
        </module>
        <module caption="Universal Serial Interface" name="USI">
            <register-group caption="Universal Serial Interface" name="USI">
                <register caption="USI Data Register" name="USIDR" offset="0xBA" size="1" mask="0xFF"/>
