bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA329P.xml
                <register caption="LCD Data Register 11" name="LCDDR11" offset="0xF7" size="1" mask="0xFF">
                    <bitfield caption="LCD memory bit segment" mask="0x01" name="SEG208"/>
                    <bitfield caption="LCD memory bit segment" mask="0x02" name="SEG209"/>
                    <bitfield caption="LCD memory bit segment" mask="0x04" name="SEG210"/>
                    <bitfield caption="LCD memory bit segment" mask="0x08" name="SEG211"/>
                    <bitfield caption="LCD memory bit segment" mask="0x10" name="SEG212"/>
                    <bitfield caption="LCD memory bit segment" mask="0x20" name="SEG213"/>
                    <bitfield caption="LCD memory bit segment" mask="0x40" name="SEG214"/>
                    <bitfield caption="LCD memory bit segment" mask="0x80" name="SEG215"/>
                </register>
                <register caption="LCD Data Register 10" name="LCDDR10" offset="0xF6" size="1" mask="0xFF">
                    <bitfield caption="LCD memory bit segment" mask="0x01" name="SEG200"/>
                    <bitfield caption="LCD memory bit segment" mask="0x02" name="SEG201"/>
                    <bitfield caption="LCD memory bit segment" mask="0x04" name="SEG202"/>
                    <bitfield caption="LCD memory bit segment" mask="0x08" name="SEG203"/>
                    <bitfield caption="LCD memory bit segment" mask="0x10" name="SEG204"/>
                    <bitfield caption="LCD memory bit segment" mask="0x20" name="SEG205"/>
                    <bitfield caption="LCD memory bit segment" mask="0x40" name="SEG206"/>
                    <bitfield caption="LCD memory bit segment" mask="0x80" name="SEG207"/>
                </register>
                <register caption="LCD Data Register 8" name="LCDDR8" offset="0xF4" size="1" mask="0x01">
                    <bitfield caption="LCD memory bit segment" mask="0x01" name="SEG124"/>
                    <bitfield caption="LCD memory bit segment" mask="0x02" name="SEG125"/>
                    <bitfield caption="LCD memory bit segment" mask="0x04" name="SEG126"/>
                    <bitfield caption="LCD memory bit segment" mask="0x08" name="SEG127"/>
                    <bitfield caption="LCD memory bit segment" mask="0x10" name="SEG128"/>
                    <bitfield caption="LCD memory bit segment" mask="0x20" name="SEG129"/>
                    <bitfield caption="LCD memory bit segment" mask="0x40" name="SEG130"/>
                    <bitfield caption="LCD memory bit segment" mask="0x80" name="SEG131"/>
                </register>
                <register caption="LCD Data Register 7" name="LCDDR7" offset="0xF3" size="1" mask="0xFF">
                    <bitfield caption="LCD memory bit segment" mask="0x01" name="SEG116"/>
                    <bitfield caption="LCD memory bit segment" mask="0x02" name="SEG117"/>
                    <bitfield caption="LCD memory bit segment" mask="0x04" name="SEG118"/>
                    <bitfield caption="LCD memory bit segment" mask="0x08" name="SEG119"/>
                    <bitfield caption="LCD memory bit segment" mask="0x10" name="SEG120"/>
                    <bitfield caption="LCD memory bit segment" mask="0x20" name="SEG121"/>
                    <bitfield caption="LCD memory bit segment" mask="0x40" name="SEG122"/>
                    <bitfield caption="LCD memory bit segment" mask="0x80" name="SEG123"/>
                </register>
                <register caption="LCD Data Register 6" name="LCDDR6" offset="0xF2" size="1" mask="0xFF">
                    <bitfield caption="LCD memory bit segment" mask="0x01" name="SEG108"/>
                    <bitfield caption="LCD memory bit segment" mask="0x02" name="SEG109"/>
                    <bitfield caption="LCD memory bit segment" mask="0x04" name="SEG110"/>
                    <bitfield caption="LCD memory bit segment" mask="0x08" name="SEG111"/>
                    <bitfield caption="LCD memory bit segment" mask="0x10" name="SEG112"/>
                    <bitfield caption="LCD memory bit segment" mask="0x20" name="SEG113"/>
                    <bitfield caption="LCD memory bit segment" mask="0x40" name="SEG114"/>
                    <bitfield caption="LCD memory bit segment" mask="0x80" name="SEG115"/>
                </register>
                <register caption="LCD Data Register 5" name="LCDDR5" offset="0xF1" size="1" mask="0xFF">
                    <bitfield caption="LCD memory bit segment" mask="0x01" name="SEG100"/>
                    <bitfield caption="LCD memory bit segment" mask="0x02" name="SEG101"/>
                    <bitfield caption="LCD memory bit segment" mask="0x04" name="SEG102"/>
                    <bitfield caption="LCD memory bit segment" mask="0x08" name="SEG103"/>
                    <bitfield caption="LCD memory bit segment" mask="0x10" name="SEG104"/>
                    <bitfield caption="LCD memory bit segment" mask="0x20" name="SEG105"/>
                    <bitfield caption="LCD memory bit segment" mask="0x40" name="SEG106"/>
                    <bitfield caption="LCD memory bit segment" mask="0x80" name="SEG107"/>
                </register>
                <register caption="LCD Data Register 3" name="LCDDR3" offset="0xEF" size="1" mask="0x01">
                    <bitfield caption="LCD memory bit segment" mask="0x01" name="SEG024"/>
                    <bitfield caption="LCD memory bit segment" mask="0x02" name="SEG025"/>
                    <bitfield caption="LCD memory bit segment" mask="0x04" name="SEG026"/>
                    <bitfield caption="LCD memory bit segment" mask="0x08" name="SEG027"/>
                    <bitfield caption="LCD memory bit segment" mask="0x10" name="SEG028"/>
                    <bitfield caption="LCD memory bit segment" mask="0x20" name="SEG029"/>
                    <bitfield caption="LCD memory bit segment" mask="0x40" name="SEG030"/>
                    <bitfield caption="LCD memory bit segment" mask="0x80" name="SEG031"/>
                </register>
                <register caption="LCD Data Register 2" name="LCDDR2" offset="0xEE" size="1" mask="0xFF">
                    <bitfield caption="LCD memory bit segment" mask="0x01" name="SEG016"/>
                    <bitfield caption="LCD memory bit segment" mask="0x02" name="SEG017"/>
                    <bitfield caption="LCD memory bit segment" mask="0x04" name="SEG018"/>
                    <bitfield caption="LCD memory bit segment" mask="0x08" name="SEG019"/>
                    <bitfield caption="LCD memory bit segment" mask="0x10" name="SEG020"/>
                    <bitfield caption="LCD memory bit segment" mask="0x20" name="SEG021"/>
                    <bitfield caption="LCD memory bit segment" mask="0x40" name="SEG022"/>
                    <bitfield caption="LCD memory bit segment" mask="0x80" name="SEG023"/>
                </register>
                <register caption="LCD Data Register 1" name="LCDDR1" offset="0xED" size="1" mask="0xFF">
                    <bitfield caption="LCD memory bit segment" mask="0x01" name="SEG008"/>
                    <bitfield caption="LCD memory bit segment" mask="0x02" name="SEG009"/>
                    <bitfield caption="LCD memory bit segment" mask="0x04" name="SEG010"/>
                    <bitfield caption="LCD memory bit segment" mask="0x08" name="SEG011"/>
                    <bitfield caption="LCD memory bit segment" mask="0x10" name="SEG012"/>
                    <bitfield caption="LCD memory bit segment" mask="0x20" name="SEG013"/>
                    <bitfield caption="LCD memory bit segment" mask="0x40" name="SEG014"/>
                    <bitfield caption="LCD memory bit segment" mask="0x80" name="SEG015"/>
                </register>
                <register caption="LCD Data Register 0" name="LCDDR0" offset="0xEC" size="1" mask="0xFF">
                    <bitfield caption="LCD memory bit segment" mask="0x01" name="SEG000"/>
                    <bitfield caption="LCD memory bit segment" mask="0x02" name="SEG001"/>
                    <bitfield caption="LCD memory bit segment" mask="0x04" name="SEG002"/>
                    <bitfield caption="LCD memory bit segment" mask="0x08" name="SEG003"/>
                    <bitfield caption="LCD memory bit segment" mask="0x10" name="SEG004"/>
                    <bitfield caption="LCD memory bit segment" mask="0x20" name="SEG005"/>
                    <bitfield caption="LCD memory bit segment" mask="0x40" name="SEG006"/>
                    <bitfield caption="LCD memory bit segment" mask="0x80" name="SEG007"/>
                </register>
                <register caption="LCD Contrast Control Register" name="LCDCCR" offset="0xE7" size="1">
                    <bitfield caption="" mask="0xE0" name="LCDDC" values="LCD_DISP_CONF_DRIVE"/>
                    <bitfield caption="LCD Maximum Drive Time" mask="0x10" name="LCDMDT"/>
                    <bitfield caption="LCD Contrast Controls" mask="0x0F" name="LCDCC" values="LCD_CONTRAST"/>
                </register>
