bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA329P.xml
                <register caption="Stack Pointer " name="SP" offset="0x5D" size="2" mask="0xFFFF"/>
                <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
                    <bitfield caption="JTAG Interface Disable" mask="0x80" name="JTD"/>
                    <bitfield caption="BOD Sleep" mask="0x40" name="BODS"/>
                    <bitfield caption="BOD Sleep Enable" mask="0x20" name="BODSE"/>
                    <bitfield caption="Pull-up disable" mask="0x10" name="PUD"/>
                    <bitfield caption="Interrupt Vector Select" mask="0x02" name="IVSEL"/>
                    <bitfield caption="Interrupt Vector Change Enable" mask="0x01" name="IVCE"/>
                </register>
                <register caption="MCU Status Register" name="MCUSR" offset="0x54" size="1">
                    <bitfield caption="JTAG Reset Flag" mask="0x10" name="JTRF"/>
                    <bitfield caption="Watchdog Reset Flag" mask="0x08" name="WDRF"/>
                    <bitfield caption="Brown-out Reset Flag" mask="0x04" name="BORF"/>
                    <bitfield caption="External Reset Flag" mask="0x02" name="EXTRF"/>
                    <bitfield caption="Power-on reset flag" mask="0x01" name="PORF"/>
                </register>
                <register caption="Oscillator Calibration Value" name="OSCCAL" offset="0x66" size="1" mask="0xFF">
                    <bitfield caption="Oscillator Calibration " mask="0xFF" name="OSCCAL"/>
                </register>
                <register caption="Clock Prescale Register" name="CLKPR" offset="0x61" size="1">
                    <bitfield caption="Clock Prescaler Change Enable" mask="0x80" name="CLKPCE"/>
                    <bitfield caption="Clock Prescaler Select Bits" mask="0x0F" name="CLKPS"
                              values="CPU_CLK_PRESCALE_4_BITS_SMALL"/>
                </register>
                <register caption="Power Reduction Register" name="PRR" offset="0x64" size="1">
                    <bitfield caption="Power Reduction LCD" mask="0x10" name="PRLCD"/>
                    <bitfield caption="Power Reduction Timer/Counter1" mask="0x08" name="PRTIM1"/>
                    <bitfield caption="Power Reduction Serial Peripheral Interface" mask="0x04" name="PRSPI"/>
                    <bitfield caption="Power Reduction USART" mask="0x02" name="PRUSART0"/>
                    <bitfield caption="Power Reduction ADC" mask="0x01" name="PRADC"/>
                </register>
                <register caption="Sleep Mode Control Register" name="SMCR" offset="0x53" size="1">
                    <bitfield caption="Sleep Mode Select bits" mask="0x0E" name="SM" values="CPU_SLEEP_MODE_3BITS2"/>
                    <bitfield caption="Sleep Enable" mask="0x01" name="SE"/>
                </register>
                <register caption="General Purpose IO Register 2" name="GPIOR2" offset="0x4B" size="1" mask="0xFF"/>
                <register caption="General Purpose IO Register 1" name="GPIOR1" offset="0x4A" size="1" mask="0xFF"/>
                <register caption="General Purpose IO Register 0" name="GPIOR0" offset="0x3E" size="1" mask="0xFF"/>
            </register-group>
            <value-group caption="" name="CPU_CLK_PRESCALE_4_BITS_SMALL">
                <value caption="1" name="VAL_0x00" value="0x00"/>
                <value caption="2" name="VAL_0x01" value="0x01"/>
                <value caption="4" name="VAL_0x02" value="0x02"/>
                <value caption="8" name="VAL_0x03" value="0x03"/>
                <value caption="16" name="VAL_0x04" value="0x04"/>
                <value caption="32" name="VAL_0x05" value="0x05"/>
                <value caption="64" name="VAL_0x06" value="0x06"/>
                <value caption="128" name="VAL_0x07" value="0x07"/>
                <value caption="256" name="VAL_0x08" value="0x08"/>
            </value-group>
            <value-group caption="" name="CPU_SLEEP_MODE_3BITS2">
                <value caption="Idle" name="IDLE" value="0x00"/>
                <value caption="ADC Noise Reduction (If Available)" name="ADC" value="0x01"/>
                <value caption="Power Down" name="PDOWN" value="0x02"/>
                <value caption="Power Save" name="PSAVE" value="0x03"/>
                <value caption="Reserved" name="VAL_0x04" value="0x04"/>
                <value caption="Reserved" name="VAL_0x05" value="0x05"/>
                <value caption="Standby" name="STDBY" value="0x06"/>
                <value caption="Reserved" name="VAL_0x07" value="0x07"/>
            </value-group>
            <value-group caption="Oscillator Calibration Values" name="OSCCAL_VALUE_ADDRESSES">
                <value value="0x00" caption="8.0 MHz" name="8_0_MHz"/>
            </value-group>
        </module>
    </modules>
    <pinouts>
        <pinout name="TQFP64" caption="TQFP64">
            <pin position="1" pad="LCDCAP"/>
            <pin position="2" pad="PE0"/>
            <pin position="3" pad="PE1"/>
            <pin position="4" pad="PE2"/>
            <pin position="5" pad="PE3"/>
            <pin position="6" pad="PE4"/>
            <pin position="7" pad="PE5"/>
            <pin position="8" pad="PE6"/>
            <pin position="9" pad="PE7"/>
            <pin position="10" pad="PB0"/>
            <pin position="11" pad="PB1"/>
            <pin position="12" pad="PB2"/>
            <pin position="13" pad="PB3"/>
            <pin position="14" pad="PB4"/>
            <pin position="15" pad="PB5"/>
            <pin position="16" pad="PB6"/>
            <pin position="17" pad="PB7"/>
            <pin position="18" pad="PG3"/>
            <pin position="19" pad="PG4"/>
            <pin position="20" pad="PG5"/>
            <pin position="21" pad="VCC"/>
            <pin position="22" pad="GND"/>
            <pin position="23" pad="XTAL2"/>
            <pin position="24" pad="XTAL1"/>
            <pin position="25" pad="PD0"/>
            <pin position="26" pad="PD1"/>
            <pin position="27" pad="PD2"/>
            <pin position="28" pad="PD3"/>
            <pin position="29" pad="PD4"/>
            <pin position="30" pad="PD5"/>
            <pin position="31" pad="PD6"/>
            <pin position="32" pad="PD7"/>
            <pin position="33" pad="PG0"/>
            <pin position="34" pad="PG1"/>
            <pin position="35" pad="PC0"/>
            <pin position="36" pad="PC1"/>
            <pin position="37" pad="PC2"/>
            <pin position="38" pad="PC3"/>
            <pin position="39" pad="PC4"/>
            <pin position="40" pad="PC5"/>
            <pin position="41" pad="PC6"/>
            <pin position="42" pad="PC7"/>
            <pin position="43" pad="PG2"/>
            <pin position="44" pad="PA7"/>
            <pin position="45" pad="PA6"/>
            <pin position="46" pad="PA5"/>
            <pin position="47" pad="PA4"/>
            <pin position="48" pad="PA3"/>
            <pin position="49" pad="PA2"/>
            <pin position="50" pad="PA1"/>
            <pin position="51" pad="PA0"/>
            <pin position="52" pad="VCC"/>
            <pin position="53" pad="GND"/>
            <pin position="54" pad="PF7"/>
            <pin position="55" pad="PF6"/>
            <pin position="56" pad="PF5"/>
            <pin position="57" pad="PF4"/>
            <pin position="58" pad="PF3"/>
            <pin position="59" pad="PF2"/>
            <pin position="60" pad="PF1"/>
            <pin position="61" pad="PF0"/>
            <pin position="62" pad="AREF"/>
            <pin position="63" pad="GND"/>
            <pin position="64" pad="AVCC"/>
        </pinout>
        <pinout name="QFN64" caption="QFN64">
            <pin position="1" pad="LCDCAP"/>
            <pin position="2" pad="PE0"/>
            <pin position="3" pad="PE1"/>
            <pin position="4" pad="PE2"/>
            <pin position="5" pad="PE3"/>
            <pin position="6" pad="PE4"/>
            <pin position="7" pad="PE5"/>
            <pin position="8" pad="PE6"/>
            <pin position="9" pad="PE7"/>
            <pin position="10" pad="PB0"/>
            <pin position="11" pad="PB1"/>
            <pin position="12" pad="PB2"/>
            <pin position="13" pad="PB3"/>
            <pin position="14" pad="PB4"/>
            <pin position="15" pad="PB5"/>
            <pin position="16" pad="PB6"/>
            <pin position="17" pad="PB7"/>
            <pin position="18" pad="PG3"/>
            <pin position="19" pad="PG4"/>
            <pin position="20" pad="PG5"/>
            <pin position="21" pad="VCC"/>
            <pin position="22" pad="GND"/>
            <pin position="23" pad="XTAL2"/>
            <pin position="24" pad="XTAL1"/>
            <pin position="25" pad="PD0"/>
            <pin position="26" pad="PD1"/>
            <pin position="27" pad="PD2"/>
            <pin position="28" pad="PD3"/>
            <pin position="29" pad="PD4"/>
            <pin position="30" pad="PD5"/>
            <pin position="31" pad="PD6"/>
            <pin position="32" pad="PD7"/>
            <pin position="33" pad="PG0"/>
            <pin position="34" pad="PG1"/>
            <pin position="35" pad="PC0"/>
            <pin position="36" pad="PC1"/>
            <pin position="37" pad="PC2"/>
            <pin position="38" pad="PC3"/>
            <pin position="39" pad="PC4"/>
            <pin position="40" pad="PC5"/>
            <pin position="41" pad="PC6"/>
            <pin position="42" pad="PC7"/>
            <pin position="43" pad="PG2"/>
            <pin position="44" pad="PA7"/>
            <pin position="45" pad="PA6"/>
            <pin position="46" pad="PA5"/>
            <pin position="47" pad="PA4"/>
            <pin position="48" pad="PA3"/>
            <pin position="49" pad="PA2"/>
            <pin position="50" pad="PA1"/>
            <pin position="51" pad="PA0"/>
            <pin position="52" pad="VCC"/>
            <pin position="53" pad="GND"/>
            <pin position="54" pad="PF7"/>
            <pin position="55" pad="PF6"/>
            <pin position="56" pad="PF5"/>
            <pin position="57" pad="PF4"/>
            <pin position="58" pad="PF3"/>
            <pin position="59" pad="PF2"/>
            <pin position="60" pad="PF1"/>
            <pin position="61" pad="PF0"/>
            <pin position="62" pad="AREF"/>
            <pin position="63" pad="GND"/>
            <pin position="64" pad="AVCC"/>
        </pinout>
    </pinouts>
</target-description-file>
